import React from "react";
import ReactDOM from "react-dom";


export default ({ CapitalWord }) => (
  <div className="form-control">
        <p1>會員服務條款
歡迎申請加入Bonny Live網站（下稱Bonny Live），Bonny Live及會員服務是由『薩摩亞商順譽世界企業股份有限公司』（下稱 薩摩亞）所建置提供。
入Bonny Live網站會員即可享有薩摩亞、各合作特約商(特約商名單將會不定期於Bonny Live網站更新並公告，詳見Bonny Live網站__________________，以下同)贈送申請人之達幣，以累積點數折抵或兌換薩摩亞或各合作特約商提供之商品，亦可享有薩摩亞暨各合作特約商提供薩摩亞、各合作特約商、各合作夥伴之行銷優惠等服務。
為了保護會員以及所有使用者的利益，並為服務提供依據，請詳細閱讀各項服務辦法及條款，當您完成會員資料的申請與提供，開始使用各種服務時，即表示您已同意接受各項說明辦法之所有內容。 約定之服務辦法與條款如有任何修改，都會公佈在Bonny Live，建議您隨時注意相關調整。如您於任何調整修改後繼續使用任一服務，表示您已同意接受修改後的約定事項。
關於您的會員註冊之個人資料，薩摩亞將依中華民國個人資料保護法與相關法令之規範，以及本網站「隱私權聲明」保護之。
網站會員資料
●	依法告知事項
●	薩摩亞為提供電子商務交易平台並保護消費者權益，乃建立會員機制，以提供完整之會員服務，謹依個人資料保護法第8條規定告知下列事項：
○	蒐集、處理、利用之目的
■	商業與技術資訊
■	客戶管理
■	會員管理
■	行銷
■	資訊與資料庫管理
■	統計調查與分析等目的
■	個人資料交易
■	其他合於營業登記項目或章程所定業務之需要
■	其他財政服務
■	公益捐贈
○	個人資料之類別：
■	辨識個人者。如姓名、地址、電話、電子郵件、寄送地址及收件人資料等。
■	辨識財務者。如信用卡或簽帳卡之號碼、個人之其他號碼或帳戶等。
■	政府資料中之辨識者。如身分證字號或護照號碼。
■	個人描述。如性別、年齡、出生年月日、國籍。
■	家庭情形。如結婚有無等。
■	休閒活動及興趣。如嗜好、運動及其他興趣等。
■	生活格調。使用消費品之種類及服務細節、個人或家庭知消費模式等。
■	財務交易。如支付方式、往來紀錄。
■	約定或契約。如關於交易、商業、法律或其他契約等
○	利用期間
○	自您同意成為會員之日起至薩摩亞或您終止本會員規約之日止。
○	利用地區、對象及方式
■	台灣地區及產品出貨地，且基於履行契約義務，將提供相關資料予會員購買產品之供應商及物流商，或薩摩亞於前揭特定目的範圍內之委外廠商。
■	薩摩亞將於蒐集之特定目的範圍內處理並利用個人資料。
○	會員就其個人資料依法得向薩摩亞以書面請求行使下列權利：
■	查詢或請求閱覽。
■	製給複製本。
■	補充或更正。
■	請求停止蒐集、處理或利用。
■	請求刪除。
○	會員行使前條任一權利，請檢附相關證明文件向薩摩亞提出書面申請，薩摩亞就該書面請求之決定，將於收到會員書面請求之次日起15日內以書面通知申請人，前述15日期間於必要時，得予再延長15日，薩摩亞並將於書面通知申請人。如會員就其個人資料向薩摩亞請求查詢、提供閱覽或製給複製本時，薩摩亞將酌收必要成本費用。前述之申請，應填具申請文件，並由本人親自申請，薩摩亞得向您請求提出可資確認身分之證明文件。若委託他人代為申請者，應出具委任書，並提供本人及代理人之之身分證明文件。
○	會員得自由選擇提供個人資料，惟若其提供之資料不足或有誤時，薩摩亞除將無法提供完整之購物服務外，亦將可能無法使其行使Bonny Live之會員權利。
●	關於網站會員註冊
○	您同意提供包括但不限於姓名、身分證字號、電話、地址、生日及電子郵件等基本資料進行註冊，以在本網站進行消費及接受本網站會員服務。
○	您確認於註冊時提供個人資料均屬真實，如您個人資料誤填或有變更時，您將隨時更正或更新，薩摩亞將依您所提供之最新資料予以更新或補充，並維護您個人資料之正確性；如您未及時更新，表示您同意薩摩亞繼續依您原登錄資料提供各項服務，若因此所受之不利益，均應由您自行承擔。
○	若您登錄不實資料，薩摩亞將於發現後暫停或終止您的會員資格，並拒絕您使用會員服務。
○	薩摩亞若發現或合理懷疑您個人資料不正確、不慎遺失或遭冒用時，將及時通知您，並停止處理或利用您的個人資料，且暫停該帳號所生交易之處理及後續利用；若您發現或合理懷疑您個人資料不正確、不慎遺失或遭冒用時，您應該立即通知薩摩亞，薩摩亞將採取必要的防範措施並視情況進行調查，但上述通知不代表薩摩亞對會員負有任何形式之賠償或補償的責任。
●	網站會員帳號、密碼及安全
○	薩摩亞將建置符合網路交易需求之安全機制，並告知您該機制之安全程度，以提供您安全的交易平台。
○	註冊網站會員資料時，您必須提供一組個人帳號與辨識密碼，且該帳號不可重複登錄。
○	您應妥善保管帳號及密碼，並於每次使用後確實登出，以防他人盜用，同時，請勿將您的帳號與密碼洩露或提供予第三人知悉，以免因此遭人非法使用，若您未能保管好帳號及密碼，因此所受之損害，將由您自行承擔。
●	關於會員提供資訊
●	請您確認上載、傳送、輸入或提供至本網站的資料，都已合法取得授權使用（下稱授權使用，包含但不限修改、重製、公開播送、改作、散布、發行、公開發表等方式），並可將前述權利轉授權第三人。任何資料一經您上載、傳送、輸入或提供至本網站時，視為您已同意薩摩亞在符合本會員服務及網站目的使用及利用已取得您的授權使用，您對此絕無異議。您並應保證薩摩亞取得授權使用的內容，均無侵害任何第三人智慧財產權的情形，如果因此造成對薩摩亞的損失或損害，您承諾將對薩摩亞負賠償或補償責任。
●	家長或監護人義務
●	如您是未滿十二歲的兒童，請確認您的家長或監護人已同意您上網使用本網站並且全程在旁陪伴；如您是十二歲以上未滿十八歲的青少年，當您上網前，請您確認您的家長或監護人已經同意您上網使用本網站。
●	資料記錄
●	當您使用本網站時，在使用過程中所有的資料紀錄，包括交易資料、付款方式及資訊、寄送地址及收件人資料，均將保存於會員服務資料庫記錄，您同意薩摩亞基於履行上述A.1之特定目的範圍內予以蒐集、利用或處理。
●	服務內容之變更與電子報及EDM發送
○	薩摩亞將得視業務需要及實際情形，增減、變更或終止相關服務的項目或內容，前述內容將公告於Bonny Live, 且不再個別通知會員。
○	會員同意薩摩亞得依實際執行情形，增加、修改或終止相關活動，並選擇最適方式告知會員。
○	會員同意薩摩亞得不定期發送電子報或商品訊息(EDM)至會員所登錄的電子信箱帳號。當會員收到訊息後表示拒絕接受行銷時，薩摩亞將停止繼續發送行銷訊息。
●	約定條款修改
●	會員同意薩摩亞得修改Bonny Live站會員約定條款，並同意薩摩亞於修改後，得以言詞、書面、電話、簡訊、電子郵件、傳真、電子文件或其它足以使會員知悉或可得知悉知方式（包括但不限於以前述方式告知提供詳載會員約定條款內容之網站聯結），告知修改內容及指定網頁。
●	如您登錄資料或您的行為與上述「會員資料」內容不符或有違反，您同意並瞭解薩摩亞將依此約定條款揭示內容處理，且表示您將自行承擔所有不便及相關法律責任。
網站會員服務
●	個人資料保護
○	基於法律之規定、或受司法機關與其他有權機關基於法定程序之要求。
○	為增進公共利益。
○	為免除會員之生命、身體、自由或財產上之危險。
○	您的會員資料遭受他人冒用，且為防止會員權益之重大危害。
○	為防止他人權益之重大危害。
○	經過會員本人書面同意。
●	智慧財產權
●	薩摩亞所使用之軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，均由薩摩亞或其他權利人依法擁有其智慧財產權；請務必於取得薩摩亞及其他權利人書面同意或授權後，才能使用前述資料。
●	服務暫停與中斷
●	本系統或功能可能因『例行性』之維護、改置或變動發生服務暫停或中斷，薩摩亞將於該暫停或中斷前以電子郵件、公告或其他適當之方式告知會員。
●	薩摩亞將以合理之方式及技術，維護會員服務之正常運作。但如有下列任一情況，薩摩亞將逕行暫停或中斷會員服務之全部或一部，且對因此所造成任何不便或損害，均不負任何賠償或補償之責任：
○	使用者有任何違反政府法令或本使用條款情形；
○	天災或其他不可抗力之因素所導致之服務停止或中斷；
○	非波力所得控制之事由而致會員服務資訊顯示不正確、或遭偽造、竄改、刪除或擷取、或致系統中斷或不能正常運作時；
○	對會員服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時；
○	其他不可歸責於薩摩亞之事由所致之服務停止或中斷。
●	網站連結
●	為方便您自行蒐集或取得資訊，本網站將提供非廣告連結，但此連結並不代表薩摩亞與此類連結網站管理者有任何合夥、僱傭或其他類似關係，其他業者經營的網站性均由各該業者自行負責，薩摩亞對任何的外部連結，不擔保其合適性、有效性、或即時性，且薩摩亞不對連結網站所提供產品、服務或資訊提供擔保或其他責任，請您留意該連結網站之交易及資訊安全性。
●	會員服務管理
○	如您的會員資料遭受他人冒用、有違反交易安全或本網站會員約定條款等情形時，薩摩亞基於維護交易安全之考量，將終止您的帳號或會員服務之使用，必要時並將您的會員註冊資料會員服務移除或刪除，您瞭解並同意薩摩亞將不對此種不當使用負擔賠償或補償責任。
○	薩摩亞可能因網站管理或其他因素，變更或終止部份或全部會員服務或活動，此類變更或終止均將貼示在Bonny Live網站相關網頁或以其他方式通知，建議您留意此類訊息。
○	您可藉由網站服務通知薩摩亞變更會員服務內容或終止會員服務，請注意薩摩亞均將在您接獲電子郵件並回覆確認次日起，對您的會員服務進行變更或終止；在此提醒您，此類變更或終止，可能會使您失去部份或全部的會員優惠或權益，請您謹慎使用。
其他
●	本約定條款解釋、補充及適用均以中華民國法令為準據法。會員約定條款中任何條款之全部或一部份無效時，不影響其他約定之效力。
●	因本條款所發生之訴訟，以台灣台北地方法院為第一審管轄法院。
</p1>
    </div>
);



